/**
 * Middle East locales
 * Author: Christopher Williams
 */

(function(_u) {
    "use strict";
    var _loc = _u.Locale;
    _u.forEach({
        ar : {
            n : "العربية",
            base : "def",
            ndigits : "arab",
            ds : "٫",
            gs : "٬",
            nn : "%1-",
            cc : "SAR",
            cu : {
                AED : "د.إ.",
                BHD : "د.ب.",
                CNY : "ي.ص",
                DZD : "د.ج.",
                EGP : "ج.م.",
                INR : "ر.ه.‏",
                IQD : "د.ع.",
                IRR : "ر.إ.",
                JOD : "د.أ.",
                KWD : "د.ك.",
                LBP : "ل.ل.",
                LYD : "د.ل.",
                MAD : "د.م.",
                MRO : "أ.م.",
                OMR : "ر.ع.",
                QAR : "ر.ق.",
                SAR : "ر.س.",
                SDG : "ج.س.",
                SYP : "ل.س.",
                TND : "د.ت.",
                YER : "ر.ي."
            },
            cf : ["$\u200f\u00a0%1", "$\u200f%1-"],
            pc : ["%1٪", "-%1٪"],
            ddigits : "arab",
            mf : ["محرم", "صفر", "ربيع الأول", "ربيع الثاني",
                "جمادى الأولى", "جمادى الثانية", "رجب", "شعبان",
                "رمضان", "شوال", "ذو القعدة", "ذو الحجة"],
            mc : null,
            df : ["الأحد", "الإثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت"],
            dc : null,
            da : ["ح", "ن", "ث", "ر", "خ", "ج", "س"],
            um : ["ص", "م"],
            lm : null,
            sc : {
                "%c" : "%A %Oe %B %X %OY",
                "%x" : "%A, %Oe %B, %OY",
                "%X" : "%Ok:%OM:%OS",
                "%r" : "%Ol:%OM:%OS %p"
            },
            dfmt : {
                // weekday, year, month, day
                "tntn" : "%A, %e %B, %Y",
                // Year, month, day
                "-ntn" : "%B %e, %Y"
            },
            timetz : "جرينتش%z {t}",
            gregory : {
                era : ["بعد الميلاد", "قبل الميلاد"]
            },
            fd : 6
        },
        "ar-AE" : {
            n : "العربية \u200e(\u200fالإمارات العربية المتحدة\u200e)",
            base : "ar",
            cc : "AED",
            mf : ["يناير", "فبراير", "مارس", "أبريل",
                "مايو", "يونيو", "يوليو", "أغسطس",
                "سبتمبر", "أكتوبر", "نوفمبر", "ديسمبر"],
            hour12 : true,
            sc : {
                "%c" : "%Oe %B, %OY %OI:%OM:%OS %p",
                "%x" : "%Oe %B, %OY",
                "%X" : "%r",
                "%r" : "%OI:%OM:%OS %p"
            }
        },
        "ar-IQ" : {
            n : "العربية \u200e(\u200fالعراق\u200e)",
            base : "ar-AE",
            cc : "IQD",
            mf : ["كانون الثاني", "شباط", "آذار", "نيسان",
                "أيار", "حزيران", "تموز", "آب",
                "أيلول", "تشرين الأول", "تشرين الثاني", "كانون الأول"]
        },
        "ar-LB" : {
            n : "العربية \u200e(\u200fلبنان\u200e)",
            base : "ar-IQ",
            cc : "LBP",
            fd : 1
        },
        "ar-MA" : {
            n : "العربية \u200e(\u200fالمملكة المغربية\u200e)",
            base : "ar-AE",
            cc : "MAD",
            // 0-9 for dates
            ddigits : "latn",
            sc : {
                "%c" : "%a %e %b %X %Y",
                "%x" : "%B %e, %Y",
                "%r" : "%I:%M:%S %p"
            },
            fd : 1
        },
        "ar-DZ" : {
            n : "العربية \u200e(\u200fالجزائر\u200e)",
            base : "ar-MA",
            cc : "DZD",
            mf : ["جانفييه", "فيفرييه", "مارس", "أفريل",
                "مي", "جوان", "جوييه", "أوت",
                "سبتمبر", "أكتوبر", "نوفمبر", "ديسمبر"],
            fd : 6
        },
        "ar-TN" : {
            n : "العربية \u200e(\u200fتونس\u200e)",
            base : "ar-DZ",
            cc : "TND",
            fd : 1
        },
        he : {
            n : "עברית",
            base : "def",
            cc : "ILS",
            cf : ["%1\u00a0$", "-%1\u00a0$"],
            mc : ["ינו", "פבר", "מרץ", "אפר",
                "מאי", "יונ", "יול", "אוג",
                "ספט", "אוק", "נוב", "דצמ"],
            mf : ["ינואר", "פברואר", "מרץ", "אפריל",
                "מאי", "יוני", "יולי", "אוגוסט",
                "ספטמבר", "אוקטובר", "נובמבר", "דצמבר"],
            da : ["א", "ב", "ג", "ד", "ה", "ו", "ש"],
            dc : ["יום א", "יום ב", "יום ג", "יום ד", "יום ה", "יום ו" ,"שבת"],
            df : ["יום ראשון", "יום שני", "יום שלישי", "יום רביעי",
                "יום חמישי", "יום שישי", "שבת"],
            um : null,
            lm : ["לפנה״צ", "אחה״צ"],
            sc : {
                "%c" : "%T %Y %b %d %a",
                "%x" : "%d/%m/%y",
                "%r" : "%I:%M:%S %P"
            },
            dfmt : {
                // weekday, year, month, day
                "tntn" : "%A %e %B %Y",
                "tnnn" : "%A %e/%N/%Y"
            },
            gregory : {
                era : ["לסה״נ", "לפנה״ס"]
            },
            fd : 0
        },
        fa : {
            n : "فارسى",
            base : "ar",
            ndigits : "arabext",
            cc : "IRR",
            cu : {
                IRR : "﷼"
            },
            nn : "\u202a\u2212%1\u202c",
            cf : ["%1\u00a0$", "\u202a\u2212%1\u202c\u00a0$"],
            pc : ["\u202a٪%1\u202c", "\u2212\u202a٪%1\u202c"],
            mf : ["ژانویه", "فوریه", "مارس", "آوریل",
                "مه", "ژوئن", "ژوئیه", "اوت",
                "سپتامبر", "اکتبر", "نوامبر", "دسامبر"],
            mc : null,
            um : ["قبل از ظهر", "بعد از ظهر"],
            lm : null,
            ddigits : "arabext",
            timetz : "{t} (GMT%z)",
            gregory : {
                era : ["ق.م.", "ب. م."]
            },
            persian : {
                era : ["ه\u200d. ش."],
                mf : ["فروردین", "اردیبهشت", "خرداد", "تیر",
                    "مرداد", "شهریور", "مهر", "آبان",
                    "آذر", "دی", "بهمن", "اسفند"]
            },
            calendar : "persian"
        }
        
    
    }, function(lProps, loc) {
        _loc[loc] = lProps;
    });
    _loc.alias("ar-AE", "ar-BH", "ar-EG", "ar-KW", "ar-LY", 
        "ar-OM", "ar-QA", "ar-SD", "ar-YE");
    _loc.alias("ar-IQ", "ar-JO", "ar-SY");
})(UsefulJS);

